/* 假设有N盏灯(N为不大于5000的正整数)，从1到N按顺序依次编号，初始时全部
处于开启状态；有M个人(M为不大于N的正整数)也从1到M依次编号。

第一个人（1号）将灯全部关闭，第二个人（2号）将编号为2的倍数的灯打开，第三
个人（3号）将编号为3的倍数的灯做相反处理（即，将打开的灯关闭，将关闭的灯
打开）。依照编号递增顺序，以后的人都和3号一样，将凡是自己编号倍数的灯做
相反处理。

请问：当第M个人操作之后，哪几盏灯是关闭的，按从小到大输出其编号，其间用
逗号间隔。

输入：输入整数 N 和 M ，以空格隔开。

输出：依次输出关闭的灯的编号，用逗号隔开。
 */
#include <stdbool.h>
#include <stdio.h>
int main() {
    int N, M, i, j, index = 0;
    bool a[5001];

    scanf("%d", &N);
    scanf("%d", &M);

    for (i = 0; i < 5001; i++)
        a[i] = false;

    for (i = 2; i <= M; i++) {
        for (j = i; j <= N; j += i) {
            a[j] = !a[j];
        }
    }

    for (i = 1; i <= N; i++) {
        if (!a[i]) {
            if (index == 0)
                printf("%d", i);
            else
                printf(",%d", i);
            index++;
        }
    }

    return 0;
}